# GetBarGeometry Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarHandlePositionData..::..GetBarGeometry Method
RebarHandlePositionData Class See Also
---
Returns the geometry for a bar at the specified index currently in the Rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public IList<Curve> GetBarGeometry(
	int barIndex
)
```

Visual Basic
---
```text
Public Function GetBarGeometry ( _
	barIndex As Integer _
) As IList(Of Curve)
```

Visual C++
---
```text
public:
IList<Curve^>^ GetBarGeometry(
	int barIndex
)
```

# ### Parameters
barIndex
    Type: System..::..Int32 The index of the bar. Should be a number between 0 and GetNumberOfBars() - 1.
# ### Return Value
Returns an array of curves that defines the bar at the specified index.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | barIndex is not in the range [ 0, GetNumberOfBars()-1 ]. |

# See Also
RebarHandlePositionData Class
Autodesk.Revit.DB.Structure Namespace